# Pandas
파이썬에서 사용하는 데이터 분석 라이브러리

In [1]:
import pandas as pd

## 1. Series
1차원 데이터(정수, 실수, 문자열 등)

### Series 객체 생성
예) 1월부터 4월까지 평균 온도 데이터(-20, -10, 10 20)

In [2]:
temp = pd.Series([-20, -10, 10, 20])
print(temp)

0   -20
1   -10
2    10
3    20
dtype: int64

In [3]:
temp[0]

-20

### Serires 객체 생성(Index 지정)

In [4]:
temp = pd.Series([-20, -10, 10, 20], index=['Jan', 'Fab', 'Mar', 'Apr'])
temp

Jan   -20
Fab   -10
Mar    10
Apr    20
dtype: int64

In [5]:
temp['Jan']

-20

## 2. DataFrame
2차원 데이터 (Series들의 모음)

### 데이터 준비
사전 (dict) 자료구조를 통해 생성

예) 슬램덩크 주요 이물 8명에 대한 데이터

In [106]:
data = {
    '이름' : ['채치수', '정대만', '송태섭', '서태웅', '강백호', '변덕규', '황태산', '윤대협'],
    '학교' : ['북산고', '북산고', '북산고', '북산고', '북산고', '능남고', '능남고', '능남고'],
    '키' : [197, 184, 168, 187, 188, 202, 188, 190],
    '국어' : [90, 40, 80, 40, 15, 80, 55, 100],
    '영어' : [85, 35, 75, 60, 20, 100, 65, 85],
    '수학' : [100, 50, 70, 70, 10, 95, 45, 90],
    '과학' : [95, 55, 80, 75, 35, 85, 40, 95],
    '사회' : [85, 25, 75, 80, 10, 80, 35, 95],
    'SW특기' : ['Python', 'Java', 'Javascript', '', '', 'C', 'PYTHON', 'C#']
}
data

{'이름': ['채치수', '정대만', '송태섭', '서태웅', '강백호', '변덕규', '황태산', '윤대협'],
 '학교': ['북산고', '북산고', '북산고', '북산고', '북산고', '능남고', '능남고', '능남고'],
 '키': [197, 184, 168, 187, 188, 202, 188, 190],
 '국어': [90, 40, 80, 40, 15, 80, 55, 100],
 '영어': [85, 35, 75, 60, 20, 100, 65, 85],
 '수학': [100, 50, 70, 70, 10, 95, 45, 90],
 '과학': [95, 55, 80, 75, 35, 85, 40, 95],
 '사회': [85, 25, 75, 80, 10, 80, 35, 95],
 'SW특기': ['Python', 'Java', 'Javascript', '', '', 'C', 'PYTHON', 'C#']}

In [110]:
data['이름']

['채치수', '정대만', '송태섭', '서태웅', '강백호', '변덕규', '황태산', '윤대협']

In [111]:
data['키']

[197, 184, 168, 187, 188, 202, 188, 190]

### DataFrame 객체 생성

In [112]:
df = pd.DataFrame(data)
df

    이름   학교    키   국어   영어   수학  과학  사회        SW특기
0  채치수  북산고  197   90   85  100  95  85      Python
1  정대만  북산고  184   40   35   50  55  25        Java
2  송태섭  북산고  168   80   75   70  80  75  Javascript
3  서태웅  북산고  187   40   60   70  75  80
4  강백호  북산고  188   15   20   10  35  10
5  변덕규  능남고  202   80  100   95  85  80           C
6  황태산  능남고  188   55   65   45  40  35      PYTHON
7  윤대협  능남고  190  100   85   90  95  95          C#

### 데이터 접근

In [113]:
df[['이름', '키']]

    이름    키
0  채치수  197
1  정대만  184
2  송태섭  168
3  서태웅  187
4  강백호  188
5  변덕규  202
6  황태산  188
7  윤대협  190

### DataFrame 객체 생성(컬럼 지정)

In [114]:
df = pd.DataFrame(data, columns=['학교', '키'])
df

    학교    키
0  북산고  197
1  북산고  184
2  북산고  168
3  북산고  187
4  북산고  188
5  능남고  202
6  능남고  188
7  능남고  190

### DataFrame 객체 생성(Index 지정)

In [115]:
df = pd.DataFrame(data, index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df

    이름   학교    키   국어   영어   수학  과학  사회        SW특기
a  채치수  북산고  197   90   85  100  95  85      Python
b  정대만  북산고  184   40   35   50  55  25        Java
c  송태섭  북산고  168   80   75   70  80  75  Javascript
d  서태웅  북산고  187   40   60   70  75  80
e  강백호  북산고  188   15   20   10  35  10
f  변덕규  능남고  202   80  100   95  85  80           C
g  황태산  능남고  188   55   65   45  40  35      PYTHON
h  윤대협  능남고  190  100   85   90  95  95          C#

## 3. Index
데이터에 접근할 수 있는 주소 값

In [116]:
df.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'], dtype='object')

### Index 이름 설정

In [117]:
df.index.name = 'no'
df

     이름   학교    키   국어   영어   수학  과학  사회        SW특기
no
a   채치수  북산고  197   90   85  100  95  85      Python
b   정대만  북산고  184   40   35   50  55  25        Java
c   송태섭  북산고  168   80   75   70  80  75  Javascript
d   서태웅  북산고  187   40   60   70  75  80
e   강백호  북산고  188   15   20   10  35  10
f   변덕규  능남고  202   80  100   95  85  80           C
g   황태산  능남고  188   55   65   45  40  35      PYTHON
h   윤대협  능남고  190  100   85   90  95  95          C#

### Index 초기화

In [118]:
df.reset_index()

  no   이름   학교    키   국어   영어   수학  과학  사회        SW특기
0  a  채치수  북산고  197   90   85  100  95  85      Python
1  b  정대만  북산고  184   40   35   50  55  25        Java
2  c  송태섭  북산고  168   80   75   70  80  75  Javascript
3  d  서태웅  북산고  187   40   60   70  75  80
4  e  강백호  북산고  188   15   20   10  35  10
5  f  변덕규  능남고  202   80  100   95  85  80           C
6  g  황태산  능남고  188   55   65   45  40  35      PYTHON
7  h  윤대협  능남고  190  100   85   90  95  95          C#

In [119]:
df.reset_index(drop=True)

    이름   학교    키   국어   영어   수학  과학  사회        SW특기
0  채치수  북산고  197   90   85  100  95  85      Python
1  정대만  북산고  184   40   35   50  55  25        Java
2  송태섭  북산고  168   80   75   70  80  75  Javascript
3  서태웅  북산고  187   40   60   70  75  80
4  강백호  북산고  188   15   20   10  35  10
5  변덕규  능남고  202   80  100   95  85  80           C
6  황태산  능남고  188   55   65   45  40  35      PYTHON
7  윤대협  능남고  190  100   85   90  95  95          C#

In [120]:
df.reset_index(drop=True, inplace=True)
df

    이름   학교    키   국어   영어   수학  과학  사회        SW특기
0  채치수  북산고  197   90   85  100  95  85      Python
1  정대만  북산고  184   40   35   50  55  25        Java
2  송태섭  북산고  168   80   75   70  80  75  Javascript
3  서태웅  북산고  187   40   60   70  75  80
4  강백호  북산고  188   15   20   10  35  10
5  변덕규  능남고  202   80  100   95  85  80           C
6  황태산  능남고  188   55   65   45  40  35      PYTHON
7  윤대협  능남고  190  100   85   90  95  95          C#

### Index 설정
지정한 Column으로 Index 설정

In [121]:
df.set_index('이름')

      학교    키   국어   영어   수학  과학  사회        SW특기
이름
채치수  북산고  197   90   85  100  95  85      Python
정대만  북산고  184   40   35   50  55  25        Java
송태섭  북산고  168   80   75   70  80  75  Javascript
서태웅  북산고  187   40   60   70  75  80
강백호  북산고  188   15   20   10  35  10
변덕규  능남고  202   80  100   95  85  80           C
황태산  능남고  188   55   65   45  40  35      PYTHON
윤대협  능남고  190  100   85   90  95  95          C#

In [122]:
df.set_index('이름', inplace=True)
df

      학교    키   국어   영어   수학  과학  사회        SW특기
이름
채치수  북산고  197   90   85  100  95  85      Python
정대만  북산고  184   40   35   50  55  25        Java
송태섭  북산고  168   80   75   70  80  75  Javascript
서태웅  북산고  187   40   60   70  75  80
강백호  북산고  188   15   20   10  35  10
변덕규  능남고  202   80  100   95  85  80           C
황태산  능남고  188   55   65   45  40  35      PYTHON
윤대협  능남고  190  100   85   90  95  95          C#

### Index 정렬

In [123]:
df.sort_index()

      학교    키   국어   영어   수학  과학  사회        SW특기
이름
강백호  북산고  188   15   20   10  35  10
변덕규  능남고  202   80  100   95  85  80           C
서태웅  북산고  187   40   60   70  75  80
송태섭  북산고  168   80   75   70  80  75  Javascript
윤대협  능남고  190  100   85   90  95  95          C#
정대만  북산고  184   40   35   50  55  25        Java
채치수  북산고  197   90   85  100  95  85      Python
황태산  능남고  188   55   65   45  40  35      PYTHON

In [124]:
df.sort_index(ascending=False)

      학교    키   국어   영어   수학  과학  사회        SW특기
이름
황태산  능남고  188   55   65   45  40  35      PYTHON
채치수  북산고  197   90   85  100  95  85      Python
정대만  북산고  184   40   35   50  55  25        Java
윤대협  능남고  190  100   85   90  95  95          C#
송태섭  북산고  168   80   75   70  80  75  Javascript
서태웅  북산고  187   40   60   70  75  80
변덕규  능남고  202   80  100   95  85  80           C
강백호  북산고  188   15   20   10  35  10

## 4. 파일 저장 및 열기
DataFrame 객체를 파일로 저장 및 열기

In [125]:
df = pd.DataFrame(data, index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df.index.name = 'no'
df

     이름   학교    키   국어   영어   수학  과학  사회        SW특기
no
a   채치수  북산고  197   90   85  100  95  85      Python
b   정대만  북산고  184   40   35   50  55  25        Java
c   송태섭  북산고  168   80   75   70  80  75  Javascript
d   서태웅  북산고  187   40   60   70  75  80
e   강백호  북산고  188   15   20   10  35  10
f   변덕규  능남고  202   80  100   95  85  80           C
g   황태산  능남고  188   55   65   45  40  35      PYTHON
h   윤대협  능남고  190  100   85   90  95  95          C#

### 저장하기
CSV 파일로 저장

In [126]:
df.to_csv('score.csv', encoding='utf-8-sig')

In [127]:
df.to_csv('score_no_index.csv', encoding='utf-8-sig', index=False)

#### txt 파일로 저장

In [128]:
df.to_csv('score.txt', encoding='utf-8-sig', sep='\t')

#### Excel 파일로 저장

In [129]:
df.to_excel('score.xlsx')

### 열기

CSV 파일 열기

In [130]:
df = pd.read_csv('score.csv')
df

  no   이름   학교    키   국어   영어   수학  과학  사회        SW특기
0  a  채치수  북산고  197   90   85  100  95  85      Python
1  b  정대만  북산고  184   40   35   50  55  25        Java
2  c  송태섭  북산고  168   80   75   70  80  75  Javascript
3  d  서태웅  북산고  187   40   60   70  75  80         NaN
4  e  강백호  북산고  188   15   20   10  35  10         NaN
5  f  변덕규  능남고  202   80  100   95  85  80           C
6  g  황태산  능남고  188   55   65   45  40  35      PYTHON
7  h  윤대협  능남고  190  100   85   90  95  95          C#

In [131]:
df = pd.read_csv('score.csv', skiprows=5)
df

   e  강백호  북산고  188   15   20  10  35  10.1 Unnamed: 9
0  f  변덕규  능남고  202   80  100  95  85    80          C
1  g  황태산  능남고  188   55   65  45  40    35     PYTHON
2  h  윤대협  능남고  190  100   85  90  95    95         C#

In [132]:
df = pd.read_csv('score.csv', skiprows=[1, 3, 5])
df

  no   이름   학교    키   국어   영어  수학  과학  사회    SW특기
0  b  정대만  북산고  184   40   35  50  55  25    Java
1  d  서태웅  북산고  187   40   60  70  75  80     NaN
2  f  변덕규  능남고  202   80  100  95  85  80       C
3  g  황태산  능남고  188   55   65  45  40  35  PYTHON
4  h  윤대협  능남고  190  100   85  90  95  95      C#

In [133]:
df = pd.read_csv('score.csv', nrows=4)
df

  no   이름   학교    키  국어  영어   수학  과학  사회        SW특기
0  a  채치수  북산고  197  90  85  100  95  85      Python
1  b  정대만  북산고  184  40  35   50  55  25        Java
2  c  송태섭  북산고  168  80  75   70  80  75  Javascript
3  d  서태웅  북산고  187  40  60   70  75  80         NaN

In [134]:
df = pd.read_csv('score.csv', index_col='no')
df

     이름   학교    키   국어   영어   수학  과학  사회        SW특기
no
a   채치수  북산고  197   90   85  100  95  85      Python
b   정대만  북산고  184   40   35   50  55  25        Java
c   송태섭  북산고  168   80   75   70  80  75  Javascript
d   서태웅  북산고  187   40   60   70  75  80         NaN
e   강백호  북산고  188   15   20   10  35  10         NaN
f   변덕규  능남고  202   80  100   95  85  80           C
g   황태산  능남고  188   55   65   45  40  35      PYTHON
h   윤대협  능남고  190  100   85   90  95  95          C#

#### Excel 파일 열기

In [195]:
df = pd.read_excel('score.xlsx', index_col='no')
df

     이름   학교    키   국어   영어   수학  과학  사회        SW특기
no
a   채치수  북산고  197   90   85  100  95  85      Python
b   정대만  북산고  184   40   35   50  55  25        Java
c   송태섭  북산고  168   80   75   70  80  75  Javascript
d   서태웅  북산고  187   40   60   70  75  80         NaN
e   강백호  북산고  188   15   20   10  35  10         NaN
f   변덕규  능남고  202   80  100   95  85  80           C
g   황태산  능남고  188   55   65   45  40  35      PYTHON
h   윤대협  능남고  190  100   85   90  95  95          C#

## 5. 데이터확인

### DataFrame 확인
숫자 데이터에 대해 갯수, 평균, 표준편차, 최소/최대값 등의 정보를 보여줌

In [136]:
df.describe()

                키          국어          영어          수학         과학         사회
count    8.000000    8.000000    8.000000    8.000000   8.000000   8.000000
mean   188.000000   62.500000   65.625000   66.250000  70.000000  60.625000
std      9.985704   29.519969   26.917533   30.325614  23.754699  32.120032
min    168.000000   15.000000   20.000000   10.000000  35.000000  10.000000
25%    186.250000   40.000000   53.750000   48.750000  51.250000  32.500000
50%    188.000000   67.500000   70.000000   70.000000  77.500000  77.500000
75%    191.750000   82.500000   85.000000   91.250000  87.500000  81.250000
max    202.000000  100.000000  100.000000  100.000000  95.000000  95.000000

In [137]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, a to h
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      8 non-null      object
 1   학교      8 non-null      object
 2   키       8 non-null      int64
 3   국어      8 non-null      int64
 4   영어      8 non-null      int64
 5   수학      8 non-null      int64
 6   과학      8 non-null      int64
 7   사회      8 non-null      int64
 8   SW특기    6 non-null      object
dtypes: int64(6), object(3)
memory usage: 640.0+ bytes

In [138]:
df.head()

     이름   학교    키  국어  영어   수학  과학  사회        SW특기
no
a   채치수  북산고  197  90  85  100  95  85      Python
b   정대만  북산고  184  40  35   50  55  25        Java
c   송태섭  북산고  168  80  75   70  80  75  Javascript
d   서태웅  북산고  187  40  60   70  75  80         NaN
e   강백호  북산고  188  15  20   10  35  10         NaN

In [139]:
df.tail()

     이름   학교    키   국어   영어  수학  과학  사회    SW특기
no
d   서태웅  북산고  187   40   60  70  75  80     NaN
e   강백호  북산고  188   15   20  10  35  10     NaN
f   변덕규  능남고  202   80  100  95  85  80       C
g   황태산  능남고  188   55   65  45  40  35  PYTHON
h   윤대협  능남고  190  100   85  90  95  95      C#

In [140]:
df.values

array([['채치수', '북산고', 197, 90, 85, 100, 95, 85, 'Python'],
       ['정대만', '북산고', 184, 40, 35, 50, 55, 25, 'Java'],
       ['송태섭', '북산고', 168, 80, 75, 70, 80, 75, 'Javascript'],
       ['서태웅', '북산고', 187, 40, 60, 70, 75, 80, nan],
       ['강백호', '북산고', 188, 15, 20, 10, 35, 10, nan],
       ['변덕규', '능남고', 202, 80, 100, 95, 85, 80, 'C'],
       ['황태산', '능남고', 188, 55, 65, 45, 40, 35, 'PYTHON'],
       ['윤대협', '능남고', 190, 100, 85, 90, 95, 95, 'C#']], dtype=object)

In [141]:
df.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'], dtype='object', name='no')

In [142]:
df.columns

Index(['이름', '학교', '키', '국어', '영어', '수학', '과학', '사회', 'SW특기'], dtype='object')

In [143]:
df.shape

(8, 9)

### Series 확인

In [144]:
df['키'].describe()

count      8.000000
mean     188.000000
std        9.985704
min      168.000000
25%      186.250000
50%      188.000000
75%      191.750000
max      202.000000
Name: 키, dtype: float64

In [145]:
df['키'].mean()

188.0

In [146]:
df['키'].nlargest(3)

no
f    202
a    197
h    190
Name: 키, dtype: int64

In [147]:
df['키'].nsmallest(3)

no
c    168
b    184
d    187
Name: 키, dtype: int64

In [148]:
df['키'].count()

8

In [149]:
df['학교'].unique()

array(['북산고', '능남고'], dtype=object)

In [150]:
df['학교'].nunique()

2

## 6. 데이터 선택(기본)

In [151]:
df

     이름   학교    키   국어   영어   수학  과학  사회        SW특기
no
a   채치수  북산고  197   90   85  100  95  85      Python
b   정대만  북산고  184   40   35   50  55  25        Java
c   송태섭  북산고  168   80   75   70  80  75  Javascript
d   서태웅  북산고  187   40   60   70  75  80         NaN
e   강백호  북산고  188   15   20   10  35  10         NaN
f   변덕규  능남고  202   80  100   95  85  80           C
g   황태산  능남고  188   55   65   45  40  35      PYTHON
h   윤대협  능남고  190  100   85   90  95  95          C#

### 컬럼 선택

In [152]:
df['이름']

no
a    채치수
b    정대만
c    송태섭
d    서태웅
e    강백호
f    변덕규
g    황태산
h    윤대협
Name: 이름, dtype: object

### 컬럼 선택(정수 인덱스)

In [153]:
df.columns[0]

'이름'

In [154]:
df[df.columns[1]]

no
a    북산고
b    북산고
c    북산고
d    북산고
e    북산고
f    능남고
g    능남고
h    능남고
Name: 학교, dtype: object

In [155]:
df[df.columns[-1]]

no
a        Python
b          Java
c    Javascript
d           NaN
e           NaN
f             C
g        PYTHON
h            C#
Name: SW특기, dtype: object

In [156]:
df['이름'][1:5]

no
b    정대만
c    송태섭
d    서태웅
e    강백호
Name: 이름, dtype: object

In [157]:
df[['이름', '키']][1:5]

     이름    키
no
b   정대만  184
c   송태섭  168
d   서태웅  187
e   강백호  188

In [158]:
df[2:6]

     이름   학교    키  국어   영어  수학  과학  사회        SW특기
no
c   송태섭  북산고  168  80   75  70  80  75  Javascript
d   서태웅  북산고  187  40   60  70  75  80         NaN
e   강백호  북산고  188  15   20  10  35  10         NaN
f   변덕규  능남고  202  80  100  95  85  80           C

## 7. 데이터 선택(loc)

In [159]:
df.loc['a']

이름         채치수
학교         북산고
키          197
국어          90
영어          85
수학         100
과학          95
사회          85
SW특기    Python
Name: a, dtype: object

In [160]:
df.loc['b', '키']

184

In [161]:
df.loc[['a', 'b'], '키']

no
a    197
b    184
Name: 키, dtype: int64

In [162]:
df.loc[['a', 'b'], ['이름', '키']]

     이름    키
no
a   채치수  197
b   정대만  184

In [163]:
df.loc['a':'c', '이름':'키']

     이름   학교    키
no
a   채치수  북산고  197
b   정대만  북산고  184
c   송태섭  북산고  168

## 8. 데이터 선택(iloc)
외치를 이용하여 원하는 row에서 원하는 col 선택

In [164]:
df

     이름   학교    키   국어   영어   수학  과학  사회        SW특기
no
a   채치수  북산고  197   90   85  100  95  85      Python
b   정대만  북산고  184   40   35   50  55  25        Java
c   송태섭  북산고  168   80   75   70  80  75  Javascript
d   서태웅  북산고  187   40   60   70  75  80         NaN
e   강백호  북산고  188   15   20   10  35  10         NaN
f   변덕규  능남고  202   80  100   95  85  80           C
g   황태산  능남고  188   55   65   45  40  35      PYTHON
h   윤대협  능남고  190  100   85   90  95  95          C#

In [165]:
df.iloc[0]

이름         채치수
학교         북산고
키          197
국어          90
영어          85
수학         100
과학          95
사회          85
SW특기    Python
Name: a, dtype: object

In [166]:
df.iloc[0:5, 0:1]

     이름
no
a   채치수
b   정대만
c   송태섭
d   서태웅
e   강백호

In [167]:
df.iloc[[0,1], 2]

no
a    197
b    184
Name: 키, dtype: int64

## 9. 데이터 선택(조건)

In [168]:
df['키'] >= 185

no
a     True
b    False
c    False
d     True
e     True
f     True
g     True
h     True
Name: 키, dtype: bool

In [169]:
Filter = (df['키'] >= 185)
df[Filter]

     이름   학교    키   국어   영어   수학  과학  사회    SW특기
no
a   채치수  북산고  197   90   85  100  95  85  Python
d   서태웅  북산고  187   40   60   70  75  80     NaN
e   강백호  북산고  188   15   20   10  35  10     NaN
f   변덕규  능남고  202   80  100   95  85  80       C
g   황태산  능남고  188   55   65   45  40  35  PYTHON
h   윤대협  능남고  190  100   85   90  95  95      C#

In [170]:
df[~Filter]

     이름   학교    키  국어  영어  수학  과학  사회        SW특기
no
b   정대만  북산고  184  40  35  50  55  25        Java
c   송태섭  북산고  168  80  75  70  80  75  Javascript

In [171]:
df[df['키'] >= 185]

     이름   학교    키   국어   영어   수학  과학  사회    SW특기
no
a   채치수  북산고  197   90   85  100  95  85  Python
d   서태웅  북산고  187   40   60   70  75  80     NaN
e   강백호  북산고  188   15   20   10  35  10     NaN
f   변덕규  능남고  202   80  100   95  85  80       C
g   황태산  능남고  188   55   65   45  40  35  PYTHON
h   윤대협  능남고  190  100   85   90  95  95      C#

In [172]:
df.loc[Filter, ['이름', '학교']]

     이름   학교
no
a   채치수  북산고
d   서태웅  북산고
e   강백호  북산고
f   변덕규  능남고
g   황태산  능남고
h   윤대협  능남고

### 다양한 조건

In [173]:
df.loc[(df['키']>185) & (df['학교'] == '북산고')]

     이름   학교    키  국어  영어   수학  과학  사회    SW특기
no
a   채치수  북산고  197  90  85  100  95  85  Python
d   서태웅  북산고  187  40  60   70  75  80     NaN
e   강백호  북산고  188  15  20   10  35  10     NaN

In [174]:
df.loc[(df['키']<185) | (df['키']>200)]

     이름   학교    키  국어   영어  수학  과학  사회        SW특기
no
b   정대만  북산고  184  40   35  50  55  25        Java
c   송태섭  북산고  168  80   75  70  80  75  Javascript
f   변덕규  능남고  202  80  100  95  85  80           C

### str 함수

In [175]:
Filter = df['이름'].str.startswith('송')
df[Filter]

     이름   학교    키  국어  영어  수학  과학  사회        SW특기
no
c   송태섭  북산고  168  80  75  70  80  75  Javascript

In [176]:
Filter = df['이름'].str.contains('태')
df[Filter]

     이름   학교    키  국어  영어  수학  과학  사회        SW특기
no
c   송태섭  북산고  168  80  75  70  80  75  Javascript
d   서태웅  북산고  187  40  60  70  75  80         NaN
g   황태산  능남고  188  55  65  45  40  35      PYTHON

In [177]:
df[~Filter]

     이름   학교    키   국어   영어   수학  과학  사회    SW특기
no
a   채치수  북산고  197   90   85  100  95  85  Python
b   정대만  북산고  184   40   35   50  55  25    Java
e   강백호  북산고  188   15   20   10  35  10     NaN
f   변덕규  능남고  202   80  100   95  85  80       C
h   윤대협  능남고  190  100   85   90  95  95      C#

In [178]:
Filter = df['이름'].isin(['정대만', '변덕규'])
df[Filter]

     이름   학교    키  국어   영어  수학  과학  사회  SW특기
no
b   정대만  북산고  184  40   35  50  55  25  Java
f   변덕규  능남고  202  80  100  95  85  80     C

### contains 함수의 na 처리

In [181]:
Filter = df['SW특기'].str.contains('Java')
df[Filter]

ValueError: Cannot mask with non-boolean array containing NA / NaN values

In [182]:
Filter = df['SW특기'].str.contains('Java', na=False)
df[Filter]

     이름   학교    키  국어  영어  수학  과학  사회        SW특기
no
b   정대만  북산고  184  40  35  50  55  25        Java
c   송태섭  북산고  168  80  75  70  80  75  Javascript

## 10. 결측치

In [203]:
df.fillna('없음')

  no   이름   학교    키   국어   영어   수학  과학  사회        SW특기
0  a  채치수  북산고  197   90   85  100  95  85      Python
1  b  정대만  북산고  184   40   35   50  55  25        Java
2  c  송태섭  북산고  168   80   75   70  80  75  Javascript
3  d  서태웅  북산고  187   40   60   70  75  80          없음
4  e  강백호  북산고  188   15   20   10  35  10          없음
5  f  변덕규  능남고  202   80  100   95  85  80           C
6  g  황태산  능남고  188   55   65   45  40  35      PYTHON
7  h  윤대협  능남고  190  100   85   90  95  95          C#

In [209]:
import numpy as np
df['학교'] = np.nan
df

  no   이름  학교    키   국어   영어   수학  과학  사회        SW특기
0  a  채치수 NaN  197   90   85  100  95  85      Python
1  b  정대만 NaN  184   40   35   50  55  25        Java
2  c  송태섭 NaN  168   80   75   70  80  75  Javascript
3  d  서태웅 NaN  187   40   60   70  75  80          모름
4  e  강백호 NaN  188   15   20   10  35  10          모름
5  f  변덕규 NaN  202   80  100   95  85  80           C
6  g  황태산 NaN  188   55   65   45  40  35      PYTHON
7  h  윤대협 NaN  190  100   85   90  95  95          C#

In [210]:
df.fillna('모름')

  no   이름  학교    키   국어   영어   수학  과학  사회        SW특기
0  a  채치수  모름  197   90   85  100  95  85      Python
1  b  정대만  모름  184   40   35   50  55  25        Java
2  c  송태섭  모름  168   80   75   70  80  75  Javascript
3  d  서태웅  모름  187   40   60   70  75  80          모름
4  e  강백호  모름  188   15   20   10  35  10          모름
5  f  변덕규  모름  202   80  100   95  85  80           C
6  g  황태산  모름  188   55   65   45  40  35      PYTHON
7  h  윤대협  모름  190  100   85   90  95  95          C#

In [211]:
df.fillna('모름', inplace=True)
df

  no   이름  학교    키   국어   영어   수학  과학  사회        SW특기
0  a  채치수  모름  197   90   85  100  95  85      Python
1  b  정대만  모름  184   40   35   50  55  25        Java
2  c  송태섭  모름  168   80   75   70  80  75  Javascript
3  d  서태웅  모름  187   40   60   70  75  80          모름
4  e  강백호  모름  188   15   20   10  35  10          모름
5  f  변덕규  모름  202   80  100   95  85  80           C
6  g  황태산  모름  188   55   65   45  40  35      PYTHON
7  h  윤대협  모름  190  100   85   90  95  95          C#

In [216]:
df = pd.read_csv('score.csv')
df

  no   이름   학교    키   국어   영어   수학  과학  사회        SW특기
0  a  채치수  북산고  197   90   85  100  95  85      Python
1  b  정대만  북산고  184   40   35   50  55  25        Java
2  c  송태섭  북산고  168   80   75   70  80  75  Javascript
3  d  서태웅  북산고  187   40   60   70  75  80         NaN
4  e  강백호  북산고  188   15   20   10  35  10         NaN
5  f  변덕규  능남고  202   80  100   95  85  80           C
6  g  황태산  능남고  188   55   65   45  40  35      PYTHON
7  h  윤대협  능남고  190  100   85   90  95  95          C#

In [217]:
df['SW특기'].fillna('확인중', inplace=True)
df

  no   이름   학교    키   국어   영어   수학  과학  사회        SW특기
0  a  채치수  북산고  197   90   85  100  95  85      Python
1  b  정대만  북산고  184   40   35   50  55  25        Java
2  c  송태섭  북산고  168   80   75   70  80  75  Javascript
3  d  서태웅  북산고  187   40   60   70  75  80         확인중
4  e  강백호  북산고  188   15   20   10  35  10         확인중
5  f  변덕규  능남고  202   80  100   95  85  80           C
6  g  황태산  능남고  188   55   65   45  40  35      PYTHON
7  h  윤대협  능남고  190  100   85   90  95  95          C#

### 데이터 제외하기

In [218]:
df = pd.read_csv('score.csv')
df

  no   이름   학교    키   국어   영어   수학  과학  사회        SW특기
0  a  채치수  북산고  197   90   85  100  95  85      Python
1  b  정대만  북산고  184   40   35   50  55  25        Java
2  c  송태섭  북산고  168   80   75   70  80  75  Javascript
3  d  서태웅  북산고  187   40   60   70  75  80         NaN
4  e  강백호  북산고  188   15   20   10  35  10         NaN
5  f  변덕규  능남고  202   80  100   95  85  80           C
6  g  황태산  능남고  188   55   65   45  40  35      PYTHON
7  h  윤대협  능남고  190  100   85   90  95  95          C#

In [219]:
df.dropna()

  no   이름   학교    키   국어   영어   수학  과학  사회        SW특기
0  a  채치수  북산고  197   90   85  100  95  85      Python
1  b  정대만  북산고  184   40   35   50  55  25        Java
2  c  송태섭  북산고  168   80   75   70  80  75  Javascript
5  f  변덕규  능남고  202   80  100   95  85  80           C
6  g  황태산  능남고  188   55   65   45  40  35      PYTHON
7  h  윤대협  능남고  190  100   85   90  95  95          C#

In [221]:
df.dropna(inplace=True)
df

  no   이름   학교    키   국어   영어   수학  과학  사회        SW특기
0  a  채치수  북산고  197   90   85  100  95  85      Python
1  b  정대만  북산고  184   40   35   50  55  25        Java
2  c  송태섭  북산고  168   80   75   70  80  75  Javascript
5  f  변덕규  능남고  202   80  100   95  85  80           C
6  g  황태산  능남고  188   55   65   45  40  35      PYTHON
7  h  윤대협  능남고  190  100   85   90  95  95          C#

In [254]:
df = pd.read_csv('score.csv')
df

  no   이름   학교    키   국어   영어   수학  과학  사회        SW특기
0  a  채치수  북산고  197   90   85  100  95  85      Python
1  b  정대만  북산고  184   40   35   50  55  25        Java
2  c  송태섭  북산고  168   80   75   70  80  75  Javascript
3  d  서태웅  북산고  187   40   60   70  75  80         NaN
4  e  강백호  북산고  188   15   20   10  35  10         NaN
5  f  변덕규  능남고  202   80  100   95  85  80           C
6  g  황태산  능남고  188   55   65   45  40  35      PYTHON
7  h  윤대협  능남고  190  100   85   90  95  95          C#

### dropna 고급
- axis : index | columns
- how : any | all

In [223]:
df.dropna(axis='index', how='any')

  no   이름   학교    키   국어   영어   수학  과학  사회        SW특기
0  a  채치수  북산고  197   90   85  100  95  85      Python
1  b  정대만  북산고  184   40   35   50  55  25        Java
2  c  송태섭  북산고  168   80   75   70  80  75  Javascript
5  f  변덕규  능남고  202   80  100   95  85  80           C
6  g  황태산  능남고  188   55   65   45  40  35      PYTHON
7  h  윤대협  능남고  190  100   85   90  95  95          C#

In [227]:
df.dropna(axis='index', how='all')

  no   이름   학교    키   국어   영어   수학  과학  사회        SW특기
0  a  채치수  북산고  197   90   85  100  95  85      Python
1  b  정대만  북산고  184   40   35   50  55  25        Java
2  c  송태섭  북산고  168   80   75   70  80  75  Javascript
3  d  서태웅  북산고  187   40   60   70  75  80         NaN
4  e  강백호  북산고  188   15   20   10  35  10         NaN
5  f  변덕규  능남고  202   80  100   95  85  80           C
6  g  황태산  능남고  188   55   65   45  40  35      PYTHON
7  h  윤대협  능남고  190  100   85   90  95  95          C#

In [226]:
df.dropna(axis='columns')

  no   이름   학교    키   국어   영어   수학  과학  사회
0  a  채치수  북산고  197   90   85  100  95  85
1  b  정대만  북산고  184   40   35   50  55  25
2  c  송태섭  북산고  168   80   75   70  80  75
3  d  서태웅  북산고  187   40   60   70  75  80
4  e  강백호  북산고  188   15   20   10  35  10
5  f  변덕규  능남고  202   80  100   95  85  80
6  g  황태산  능남고  188   55   65   45  40  35
7  h  윤대협  능남고  190  100   85   90  95  95

## 11. 데이터 정렬

In [230]:
df.sort_values('키')

  no   이름   학교    키   국어   영어   수학  과학  사회        SW특기
2  c  송태섭  북산고  168   80   75   70  80  75  Javascript
1  b  정대만  북산고  184   40   35   50  55  25        Java
3  d  서태웅  북산고  187   40   60   70  75  80         NaN
4  e  강백호  북산고  188   15   20   10  35  10         NaN
6  g  황태산  능남고  188   55   65   45  40  35      PYTHON
7  h  윤대협  능남고  190  100   85   90  95  95          C#
0  a  채치수  북산고  197   90   85  100  95  85      Python
5  f  변덕규  능남고  202   80  100   95  85  80           C

In [231]:
df.sort_values('키', ascending=False)

  no   이름   학교    키   국어   영어   수학  과학  사회        SW특기
5  f  변덕규  능남고  202   80  100   95  85  80           C
0  a  채치수  북산고  197   90   85  100  95  85      Python
7  h  윤대협  능남고  190  100   85   90  95  95          C#
4  e  강백호  북산고  188   15   20   10  35  10         NaN
6  g  황태산  능남고  188   55   65   45  40  35      PYTHON
3  d  서태웅  북산고  187   40   60   70  75  80         NaN
1  b  정대만  북산고  184   40   35   50  55  25        Java
2  c  송태섭  북산고  168   80   75   70  80  75  Javascript

In [235]:
df.sort_values(['학교', '이름'], ascending=True)[['학교', '이름', '키']]

    학교   이름    키
5  능남고  변덕규  202
7  능남고  윤대협  190
6  능남고  황태산  188
4  북산고  강백호  188
3  북산고  서태웅  187
2  북산고  송태섭  168
1  북산고  정대만  184
0  북산고  채치수  197

In [236]:
df.sort_values(['학교', '이름'], ascending=[True, False])[['학교', '이름', '키']]

    학교   이름    키
6  능남고  황태산  188
7  능남고  윤대협  190
5  능남고  변덕규  202
0  북산고  채치수  197
1  북산고  정대만  184
2  북산고  송태섭  168
3  북산고  서태웅  187
4  북산고  강백호  188

In [239]:
df['키'].sort_values()

2    168
1    184
3    187
4    188
6    188
7    190
0    197
5    202
Name: 키, dtype: int64

In [240]:
df.sort_index(ascending=False)

  no   이름   학교    키   국어   영어   수학  과학  사회        SW특기
7  h  윤대협  능남고  190  100   85   90  95  95          C#
6  g  황태산  능남고  188   55   65   45  40  35      PYTHON
5  f  변덕규  능남고  202   80  100   95  85  80           C
4  e  강백호  북산고  188   15   20   10  35  10         NaN
3  d  서태웅  북산고  187   40   60   70  75  80         NaN
2  c  송태섭  북산고  168   80   75   70  80  75  Javascript
1  b  정대만  북산고  184   40   35   50  55  25        Java
0  a  채치수  북산고  197   90   85  100  95  85      Python

## 12. 데이터 수정

### 컬럼 수정

In [244]:
df['학교'].replace({'북산고':'상북고', '능남고':'무슨고'})

0    상북고
1    상북고
2    상북고
3    상북고
4    상북고
5    무슨고
6    무슨고
7    무슨고
Name: 학교, dtype: object

In [249]:
df['학교'].replace({'북산고':'상북고', '능남고':'무슨고'}, inplace=True)
df

  no   이름   학교    키   국어   영어   수학  과학  사회        SW특기
0  a  채치수  상북고  197   90   85  100  95  85      python
1  b  정대만  상북고  184   40   35   50  55  25        java
2  c  송태섭  상북고  168   80   75   70  80  75  javascript
3  d  서태웅  상북고  187   40   60   70  75  80         NaN
4  e  강백호  상북고  188   15   20   10  35  10         NaN
5  f  변덕규  무슨고  202   80  100   95  85  80           c
6  g  황태산  무슨고  188   55   65   45  40  35      python
7  h  윤대협  무슨고  190  100   85   90  95  95          c#

In [250]:
df['SW특기'] = df['SW특기'].str.lower()
df

  no   이름   학교    키   국어   영어   수학  과학  사회        SW특기
0  a  채치수  상북고  197   90   85  100  95  85      python
1  b  정대만  상북고  184   40   35   50  55  25        java
2  c  송태섭  상북고  168   80   75   70  80  75  javascript
3  d  서태웅  상북고  187   40   60   70  75  80         NaN
4  e  강백호  상북고  188   15   20   10  35  10         NaN
5  f  변덕규  무슨고  202   80  100   95  85  80           c
6  g  황태산  무슨고  188   55   65   45  40  35      python
7  h  윤대협  무슨고  190  100   85   90  95  95          c#

In [255]:
df['학교'] = df['학교'] + "등학교"
df

  no   이름      학교    키   국어   영어   수학  과학  사회        SW특기
0  a  채치수  북산고등학교  197   90   85  100  95  85      Python
1  b  정대만  북산고등학교  184   40   35   50  55  25        Java
2  c  송태섭  북산고등학교  168   80   75   70  80  75  Javascript
3  d  서태웅  북산고등학교  187   40   60   70  75  80         NaN
4  e  강백호  북산고등학교  188   15   20   10  35  10         NaN
5  f  변덕규  능남고등학교  202   80  100   95  85  80           C
6  g  황태산  능남고등학교  188   55   65   45  40  35      PYTHON
7  h  윤대협  능남고등학교  190  100   85   90  95  95          C#

In [276]:
df['총합'] = df[df.columns[4:9]].sum(axis=1)
df

  no   이름      학교    키   국어   영어   수학  과학  사회        SW특기   총합
0  a  채치수  북산고등학교  197   90   85  100  95  85      Python  455
1  b  정대만  북산고등학교  184   40   35   50  55  25        Java  205
2  c  송태섭  북산고등학교  168   80   75   70  80  75  Javascript  380
3  d  서태웅  북산고등학교  187   40   60   70  75  80         NaN  325
4  e  강백호  북산고등학교  188   15   20   10  35  10         NaN   90
5  f  변덕규  능남고등학교  202   80  100   95  85  80           C  440
6  g  황태산  능남고등학교  188   55   65   45  40  35      PYTHON  240
7  h  윤대협  능남고등학교  190  100   85   90  95  95          C#  465

In [278]:
df['결과'] = 'Fail'
df

  no   이름      학교    키   국어   영어   수학  과학  사회        SW특기   총합    결과
0  a  채치수  북산고등학교  197   90   85  100  95  85      Python  455  Fail
1  b  정대만  북산고등학교  184   40   35   50  55  25        Java  205  Fail
2  c  송태섭  북산고등학교  168   80   75   70  80  75  Javascript  380  Fail
3  d  서태웅  북산고등학교  187   40   60   70  75  80         NaN  325  Fail
4  e  강백호  북산고등학교  188   15   20   10  35  10         NaN   90  Fail
5  f  변덕규  능남고등학교  202   80  100   95  85  80           C  440  Fail
6  g  황태산  능남고등학교  188   55   65   45  40  35      PYTHON  240  Fail
7  h  윤대협  능남고등학교  190  100   85   90  95  95          C#  465  Fail

In [280]:
df.loc[df['총합'] > 400, '결과'] = 'Pass'
df

  no   이름      학교    키   국어   영어   수학  과학  사회        SW특기   총합    결과
0  a  채치수  북산고등학교  197   90   85  100  95  85      Python  455  Pass
1  b  정대만  북산고등학교  184   40   35   50  55  25        Java  205  Fail
2  c  송태섭  북산고등학교  168   80   75   70  80  75  Javascript  380  Fail
3  d  서태웅  북산고등학교  187   40   60   70  75  80         NaN  325  Fail
4  e  강백호  북산고등학교  188   15   20   10  35  10         NaN   90  Fail
5  f  변덕규  능남고등학교  202   80  100   95  85  80           C  440  Pass
6  g  황태산  능남고등학교  188   55   65   45  40  35      PYTHON  240  Fail
7  h  윤대협  능남고등학교  190  100   85   90  95  95          C#  465  Pass

### 컬럼 삭제

In [285]:
df.drop(columns = ['총합'])

  no   이름      학교    키   국어   영어   수학  과학  사회        SW특기    결과
0  a  채치수  북산고등학교  197   90   85  100  95  85      Python  Pass
1  b  정대만  북산고등학교  184   40   35   50  55  25        Java  Fail
2  c  송태섭  북산고등학교  168   80   75   70  80  75  Javascript  Fail
3  d  서태웅  북산고등학교  187   40   60   70  75  80         NaN  Fail
4  e  강백호  북산고등학교  188   15   20   10  35  10         NaN  Fail
5  f  변덕규  능남고등학교  202   80  100   95  85  80           C  Pass
6  g  황태산  능남고등학교  188   55   65   45  40  35      PYTHON  Fail
7  h  윤대협  능남고등학교  190  100   85   90  95  95          C#  Pass

In [286]:
df.drop(columns = ['국어', '영어', '수학'])

  no   이름      학교    키  과학  사회        SW특기   총합    결과
0  a  채치수  북산고등학교  197  95  85      Python  455  Pass
1  b  정대만  북산고등학교  184  55  25        Java  205  Fail
2  c  송태섭  북산고등학교  168  80  75  Javascript  380  Fail
3  d  서태웅  북산고등학교  187  75  80         NaN  325  Fail
4  e  강백호  북산고등학교  188  35  10         NaN   90  Fail
5  f  변덕규  능남고등학교  202  85  80           C  440  Pass
6  g  황태산  능남고등학교  188  40  35      PYTHON  240  Fail
7  h  윤대협  능남고등학교  190  95  95          C#  465  Pass

### Row 삭제

In [289]:
df.drop(index=2)

  no   이름      학교    키   국어   영어   수학  과학  사회    SW특기   총합    결과
0  a  채치수  북산고등학교  197   90   85  100  95  85  Python  455  Pass
1  b  정대만  북산고등학교  184   40   35   50  55  25    Java  205  Fail
3  d  서태웅  북산고등학교  187   40   60   70  75  80     NaN  325  Fail
4  e  강백호  북산고등학교  188   15   20   10  35  10     NaN   90  Fail
5  f  변덕규  능남고등학교  202   80  100   95  85  80       C  440  Pass
6  g  황태산  능남고등학교  188   55   65   45  40  35  PYTHON  240  Fail
7  h  윤대협  능남고등학교  190  100   85   90  95  95      C#  465  Pass

In [293]:
Filter = df['수학'] < 80
df.drop(index = df[Filter].index)

  no   이름      학교    키   국어   영어   수학  과학  사회    SW특기   총합    결과
0  a  채치수  북산고등학교  197   90   85  100  95  85  Python  455  Pass
5  f  변덕규  능남고등학교  202   80  100   95  85  80       C  440  Pass
7  h  윤대협  능남고등학교  190  100   85   90  95  95      C#  465  Pass

### Row 추가

In [317]:
df = pd.read_csv('score.csv')

df.reset_index(drop=True, inplace=True)
df.set_index('no', inplace=True)
df

     이름   학교    키   국어   영어   수학  과학  사회        SW특기
no
a   채치수  북산고  197   90   85  100  95  85      Python
b   정대만  북산고  184   40   35   50  55  25        Java
c   송태섭  북산고  168   80   75   70  80  75  Javascript
d   서태웅  북산고  187   40   60   70  75  80         NaN
e   강백호  북산고  188   15   20   10  35  10         NaN
f   변덕규  능남고  202   80  100   95  85  80           C
g   황태산  능남고  188   55   65   45  40  35      PYTHON
h   윤대협  능남고  190  100   85   90  95  95          C#

In [318]:
df.loc['i'] = ['이정현', '해남고등학교', 184, 90, 90, 90, 90, 90, 'Fotran']
df

     이름      학교    키   국어   영어   수학  과학  사회        SW특기
no
a   채치수     북산고  197   90   85  100  95  85      Python
b   정대만     북산고  184   40   35   50  55  25        Java
c   송태섭     북산고  168   80   75   70  80  75  Javascript
d   서태웅     북산고  187   40   60   70  75  80         NaN
e   강백호     북산고  188   15   20   10  35  10         NaN
f   변덕규     능남고  202   80  100   95  85  80           C
g   황태산     능남고  188   55   65   45  40  35      PYTHON
h   윤대협     능남고  190  100   85   90  95  95          C#
i   이정현  해남고등학교  184   90   90   90  90  90      Fotran

In [319]:
df.loc['d', 'SW특기'] = 'Python'
df

     이름      학교    키   국어   영어   수학  과학  사회        SW특기
no
a   채치수     북산고  197   90   85  100  95  85      Python
b   정대만     북산고  184   40   35   50  55  25        Java
c   송태섭     북산고  168   80   75   70  80  75  Javascript
d   서태웅     북산고  187   40   60   70  75  80      Python
e   강백호     북산고  188   15   20   10  35  10         NaN
f   변덕규     능남고  202   80  100   95  85  80           C
g   황태산     능남고  188   55   65   45  40  35      PYTHON
h   윤대협     능남고  190  100   85   90  95  95          C#
i   이정현  해남고등학교  184   90   90   90  90  90      Fotran

In [320]:
df.loc['e', ['학교', 'SW특기']] = ['능남고', 'C']
df

     이름      학교    키   국어   영어   수학  과학  사회        SW특기
no
a   채치수     북산고  197   90   85  100  95  85      Python
b   정대만     북산고  184   40   35   50  55  25        Java
c   송태섭     북산고  168   80   75   70  80  75  Javascript
d   서태웅     북산고  187   40   60   70  75  80      Python
e   강백호     능남고  188   15   20   10  35  10           C
f   변덕규     능남고  202   80  100   95  85  80           C
g   황태산     능남고  188   55   65   45  40  35      PYTHON
h   윤대협     능남고  190  100   85   90  95  95          C#
i   이정현  해남고등학교  184   90   90   90  90  90      Fotran

### Columns 순서 변경

In [327]:
cols = list(df.columns)
df[[cols[-1]]+cols[0:-1]]

          SW특기   이름      학교    키   국어   영어   수학  과학  사회
no
a       Python  채치수     북산고  197   90   85  100  95  85
b         Java  정대만     북산고  184   40   35   50  55  25
c   Javascript  송태섭     북산고  168   80   75   70  80  75
d       Python  서태웅     북산고  187   40   60   70  75  80
e            C  강백호     능남고  188   15   20   10  35  10
f            C  변덕규     능남고  202   80  100   95  85  80
g       PYTHON  황태산     능남고  188   55   65   45  40  35
h           C#  윤대협     능남고  190  100   85   90  95  95
i       Fotran  이정현  해남고등학교  184   90   90   90  90  90

In [333]:
temp = df[['학교', '이름']]
temp

        학교   이름
no
a      북산고  채치수
b      북산고  정대만
c      북산고  송태섭
d      북산고  서태웅
e      능남고  강백호
f      능남고  변덕규
g      능남고  황태산
h      능남고  윤대협
i   해남고등학교  이정현

In [335]:
temp.columns = ["School", "Name"]
temp

    School Name
no
a      북산고  채치수
b      북산고  정대만
c      북산고  송태섭
d      북산고  서태웅
e      능남고  강백호
f      능남고  변덕규
g      능남고  황태산
h      능남고  윤대협
i   해남고등학교  이정현